Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་པས། བྱང་ཆུབ་སེམས་དཔའ་དམིགས་སུ་མེད་དོ།
en: Bodhisattvas are nonapprehensible because bodhisattvas are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible bodhisattvas are neither apprehended, nor are they not apprehended.

source: །དེ་བཞིན་གཤེགས་པ་མི་དམིགས་པས། དེ་བཞིན་གཤེགས་པ་དམིགས་སུ་མེད་དོ།
en: Tathāgatas are nonapprehensible because tathāgatas are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible tathāgatas are neither apprehended, nor are they not apprehended.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མི་དམིགས་པས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དམིགས་སུ་མེད་དོ།
en: The fruit of having entered the stream to nirvāṇa is nonapprehensible because the fruit of having entered the stream to nirvāṇa is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, the nonapprehensible fruit of having entered the stream to nirvāṇa is neither apprehended, nor is it not apprehended.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་མི་དམིགས་པས། དགྲ་བཅོམ་པ་ཉིད་དམིགས་སུ་མེད་དོ།
en: The fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship are nonapprehensible because arhatship [and so forth] are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དགྲ་བཅོམ་པ་ཉིད་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible arhatship [and so forth] are neither apprehended, nor are they not apprehended.

source: །རང་བྱང་ཆུབ་མི་དམིགས་པས། རང་བྱང་ཆུབ་དམིགས་སུ་མེད་དོ།
en: Individual enlightenment is nonapprehensible because individual enlightenment is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རང་བྱང་ཆུབ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible individual enlightenment is neither apprehended, nor is it not apprehended.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་མི་དམིགས་པས། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དམིགས་སུ་མེད་དོ།
en: Knowledge of the path is nonapprehensible because knowledge of the path is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible knowledge of the path is neither apprehended, nor is it not apprehended.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མི་དམིགས་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དམིགས་སུ་མེད་དོ།
en: All-aspect omniscience is nonapprehensible because all-aspect omniscience is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible all-aspect omniscience is neither apprehended, nor is it not apprehended. “

source: །སྐྱེ་བ་མེད་པ་མི་དམིགས་པས། སྐྱེ་བ་མེད་པ་དམིགས་སུ་མེད་དོ།
en: Nonarising is nonapprehensible because nonarising is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྐྱེ་བ་མེད་པ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible nonarising is neither apprehended, nor is it not apprehended.

source: །འགག་པ་མེད་པ་མི་དམིགས་པས། འགག་པ་མེད་པ་དམིགས་སུ་མེད་དོ།
en: Nonceasing is nonapprehensible because nonceasing is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འགག་པ་མེད་པ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན།
en: If you ask why, Subhūti, nonapprehensible nonceasing is neither apprehended, nor is it not apprehended.

source: མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་མི་དམིགས་པས།
en: Nonaffliction is nonapprehensible because nonaffliction is not apprehended.

source: ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དམིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན།
en: If you ask why, Subhūti, nonapprehensible nonaffliction is neither apprehended, nor is it not apprehended.

source: མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །རྣམ་པར་བྱང་བ་མེད་པ་མི་དམིགས་པས།
en: Nonpurification is nonapprehensible because nonpurification is not apprehended.

source: རྣམ་པར་བྱང་བ་མེད་པ་དམིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྣམ་པར་བྱང་བ་མེད་པ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན།
en: If you ask why, Subhūti, nonapprehensible nonpurification is neither apprehended, nor is it not apprehended.

source: མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །མངོན་པར་འདུ་བྱ་བ་མི་དམིགས་པས། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དམིགས་སུ་མེད་དོ།
en: Nonconditioning is nonapprehensible because nonconditioning is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །དེ་བཞིན་དུ་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་དང་། ད་ལྟར་བྱུང་བ་དང་། འོང་བ་དང་།
en: If you ask why, Subhūti, nonapprehensible nonconditioning is neither apprehended, nor is it not apprehended.

source: འགྲོ་བ་དང་། གནས་པ་དང་། འཆི་འཕོ་དང་། སྐྱེ་བ་དང་འགྲིབ་པ་དང་། འཕེལ་བ་མི་དམིགས་པས།
en: Similarly, the limit of the past, the limit of the future, present events, coming, going, abiding, transmigrating at death, birth, decline, and growth are nonapprehensible because growth [and so forth] are not apprehended.

source: འཕེལ་བ་དམིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འཕེལ་བ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ།
en: If you ask why, Subhūti, nonapprehensible growth [and so forth] are neither apprehended, nor are they not apprehended. “

source: །ས་དང་པོ་མི་དམིགས་པས། ས་དང་པོ་དམིགས་སུ་མེད་དོ།
en: The first level [of realization] is nonapprehensible because the first level is not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ས་དང་པོ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །ས་གཉིས་པ་དང་། ས་གསུམ་པ་དང་། ས་བཞི་པ་དང་། ས་ལྔ་པ་དང་། ས་དྲུག་པ་དང་།
en: If you ask why, Subhūti, the nonapprehensible first level is neither apprehended, nor is it not apprehended.

source: ས་བདུན་པ་དང་། ས་བརྒྱད་པ་དང་། ས་དགུ་པ་དང་། ས་བཅུ་པ་མི་དམིགས་པས། ས་བཅུ་པ་དམིགས་སུ་མེད་དོ།
en: The second level, the third level, the fourth level, the fifth level, the sixth level, the seventh level, the eighth level, the ninth level, and the tenth level [of realization] are nonapprehensible because the tenth level [and so forth] are not apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ས་བཅུ་པ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ལ་ས་དང་པོ་ནི་གང་། ས་གཉིས་པ་དང་། ས་གསུམ་པ་དང་། ས་བཞི་པ་དང་། ས་ལྔ་པ་དང་།
en: If you ask why, Subhūti, the nonapprehensible tenth level [and so forth] are neither apprehended, nor are they not apprehended. “

source: ས་དྲུག་པ་དང་། ས་བདུན་པ་དང་། ས་བརྒྱད་པ་དང་། ས་དགུ་པ་དང་། ས་བཅུ་པ་ནི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་དང་། རིགས་ཀྱི་ས་དང་། བརྒྱད་པའི་ས་དང་། མཐོང་བའི་ས་དང་། བསྲབས་པའི་ས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་ས་དང་། བྱས་པ་རྟོགས་པའི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་དང་།
en: In this regard, if you ask what are the first level, the second level, the third level, the fourth level, the fifth level, the sixth level, the seventh level, the eighth level, the ninth level, and the tenth level, they are, respectively, (1) the level of bright insight, (2) the level of the spiritual family, (3) the eighth-lowest level, (4) the level of insight, (5) the level of attenuated refinement, (6) the level of no attachment, (7) the level of spiritual achievement, (8) the level of the pratyekabuddhas, (9) the level of the bodhisattvas, and (10) the actual level of the buddhas. “

source: བྱང་ཆུབ་སེམས་དཔའི་ས་དང་། སངས་རྒྱས་ཀྱི་ས་སྟེ། ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ས་དང་པོ་དམིགས་སུ་མེད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར།
en: Owing to the emptiness of internal phenomena, the first level is nonapprehensible, and [owing to the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the first level is nonapprehensible.

source: ས་དང་པོ་དམིགས་སུ་མེད་དོ། །ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ས་བཅུའི་བར་དུ་དམིགས་སུ་མེད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར། ས་བཅུའི་བར་དུ་དམིགས་སུ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Owing to the emptiness of internal phenomena, [the other levels], up to and including the tenth level, are nonapprehensible, and [owing to the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, [the other levels], up to and including the tenth level, are nonapprehensible.

source: རབ་འབྱོར་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ས་དང་པོ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །ས་བཅུ་པའི་བར་དུ་དམིགས་སུ་མེད་པ་ནི། དམིགས་པ་ཡང་མ་ཡིན། མི་དམིགས་པ་ཡང་མ་ཡིན་ནོ། །ཤིན་དུ་རྣམ་པར་དག་པ་ཉེ་བར་བཟུང་ན།
en: If you ask why, Subhūti, owing to their utter purity, the nonapprehensible first level is neither apprehended, nor is it not apprehended, and the [other] nonapprehensible [levels], up to and including the tenth level, are neither apprehended, nor are they not apprehended. {

source: ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དམིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པ་ཉེ་བར་བཟུང་ན། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དམིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པ་ཉེ་བར་བཟུང་ན།
en: Dt.231} “Owing to the emptiness of internal phenomena, the maturation of beings is nonapprehensible due to its utter purity, and [owing to the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the maturation of beings is nonapprehensible due to its utter purity.

source: ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དམིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པ་ཉེ་བར་བཟུང་ན། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དམིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པ་ཉེ་བར་བཟུང་ན།
en: Owing to the emptiness of internal phenomena, the refinement of the buddhafields is nonapprehensible due to its utter purity, and [owing to the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the refinement of the buddhafields is nonapprehensible due to its utter purity.

source: ནང་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། མིག་ལྔ་དམིགས་སུ་མེད་དོ། །ཤིན་དུ་རྣམ་པར་དག་པ་ཉེ་བར་བཟུང་ན། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར། མིག་ལྔ་དམིགས་སུ་མེད་དོ།
en: Owing to the emptiness of internal phenomena, the five eyes are nonapprehensible due to their utter purity, and [owing to the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the five eyes are nonapprehensible due to their utter purity. “

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཚུལ་གྱིས། ཐེག་པ་ཆེན་པོས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་རོ།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, it is through the nonapprehension of all phenomena that they will attain emancipation in all-aspect omniscience by means of the Great Vehicle.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་བཅུ་པའོ།། །།
en: This completes the tenth chapter of “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཐེག་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ཞེས་བགྱི་བ་ནི། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ་འབྱུང་བར་འགྱུར་བས།
en: Chapter 11 The venerable Subhūti then said to the Blessed One, “Blessed Lord, this Great Vehicle, which is called the Great Vehicle, outshines the world with its gods, humans, and asuras and brings emancipation from it.

source: དེའི་སླད་དུ་ཐེག་པ་ཆེན་པོ་ཞེས་བགྱིའོ།
en: That is why it is called the Great Vehicle.

source: །བཅོམ་ལྡན་འདས་ཐེག་པ་དེ་ནི་ནམ་མཁའ་དང་མཉམ་པ་སྟེ།
en: Blessed Lord, this Great Vehicle is the same as space.

source: ཇི་ལྟར་ནམ་མཁའ་སེམས་ཅན་གྲངས་དང་ཚད་མ་མཆིས་པའི་གོ་འབྱེད་པ་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་འདི་ཡང་སེམས་ཅན་གྲངས་དང་ཚད་མ་མཆིས་པའི་གོ་འབྱེད་པས།
en: Just as space accommodates countless, immeasurable beings, similarly this Great Vehicle also accommodates countless, immeasurable beings.

source: བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་སྟེ།
en: For this reason, Blessed Lord, this is the Great Vehicle of bodhisattva great beings.

source: ཐེག་པ་ཆེན་པོ་དེ་ལ་འགྲོ་བ་དང་། འོང་བ་ཞེས་བགྱི་བའམ། གནས་པ་ཡང་མ་མཆིས།
en: In this Great Vehicle, coming, going, and remaining are not discerned.

source: སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་དང་། དབུས་ཞེས་བགྱི་བ་ཡང་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན། ནམ་མཁའ་ལ་འགྲོ་བའམ་འོང་བ་ཞེས་བགྱི་བ་ཡང་མ་མཆིས་ལ།
en: An extent of the past, an extent of the future, and a present in between are also not discerned.

source: གནས་པ་ཡང་མ་མཆིས་པ་དེ་བཞིན་དུ། ཐེག་པ་ཆེན་པོ་འདི་ལ་ཡང་འགྲོ་བ་མི་དམིགས། འོང་བ་མི་དམིགས། གནས་པ་མི་དམིགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Blessed Lord, just as in space coming and going are not discerned, and remaining too is not discerned, similarly, in this Great Vehicle, going is not apprehended, coming is not apprehended, and remaining is not apprehended. “

source: ནམ་མཁའ་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་སླད་དུ། སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས། དབུས་མི་དམིགས་སོ། །དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་འདི་ཡང་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་སླད་དུ། སྔོན་གྱི་མཐའ་མི་དམིགས། ཕྱི་མའི་མཐའ་མི་དམིགས།
en: Blessed Lord, just as, due to the sameness of the three times, space does not apprehend an extent of the past, does not apprehend an extent of the future, and does not apprehend a present in between, so this Great Vehicle, also, due to the sameness of the three times, does not apprehend an extent of the past, does not apprehend an extent of the future, and does not apprehend a present in between.

source: དབུས་མི་དམིགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཐེག་པ་ཆེན་པོ་འདི་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཐེག་པ་པས། དེའི་སླད་དུ་ཐེག་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོ་ཞེས་བགྱིའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, it is because it encompasses the sameness of the three times that this Great Vehicle is called the Great Vehicle.” “

source: རབ་འབྱོར་དེ་དེ་བཞིན་ནོ།
en: That is so, Subhūti!

source: འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ནི།
en: replied the Blessed One. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: This Great Vehicle of bodhisattva great beings comprises the six perfections, {Dt.232} namely the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ཞེས་བྱའོ།
en: These denote the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་དེ།
en: Moreover, this Great Vehicle of bodhisattva great beings comprises all the dhāraṇī gateways and all the gateways of meditative stability.

source: དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པས། རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་བར་དུ་སྟེ།
en: The latter include the meditative stability named heroic valor, and [the other hundred and eighteen meditative stabilities], up to and including the meditative stability named unattached, liberated, and uncovered like space.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟ་སྟེ། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Moreover, Subhūti, this Great Vehicle of bodhisattva great beings comprises the emptiness of internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་།
en: These denote the Great Vehicle of bodhisattva great beings. “

source: སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དག་སྟེ།
en: Moreover, Subhūti, this Great Vehicle of bodhisattva great beings comprises the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: These denote the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཐེག་པ་དེ་ནི་ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ། འབྱུང་བར་འགྱུར་རོ།
en: Also, Subhūti, you said that this vehicle overpowers and attains emancipation from the world with its gods, humans, and asuras.

source: །ཞེས་སྨྲས་པ་ནི། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What, you may ask, is this world, with its gods, humans, and asuras?

source: འདོད་པའི་ཁམས་དང་། གཟུགས་ཡོད་པའི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཏེ།
en: It comprises the realm of desire, the realm of form, and the realm of formlessness.

source: རབ་འབྱོར་གལ་ཏེ་འདོད་པའི་ཁམས་དེ་བཞིན། མ་ནོར་བ་དེ་བཞིན་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཏེ། ཕྱིན་ཅི་ལོག་མ་ཡིན་ལ་བདེན་པ་ཡང་དག་པ་སྟེ། ཇི་ལྟ་བ་བཞིན་དུ་རྟག་ཅིང་བརྟན་ལ། ཐེར་ཟུག་མི་འགྱུར་བའི་ཆོས་ཅན་གྱི་དངོས་པོ་ཞིག་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་།
en: Subhūti, if the realm of desire were an entity, endowed with the attributes of being unmistaken, one and only, incontrovertible, genuine, true, qualitative, permanent, stable, eternal, and unchanging, then indeed this Great Vehicle would not overpower and attain emancipation from the world with its gods, humans, and asuras.

source: ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་འདོད་པའི་ཁམས་དེ་རྣམ་པར་བརྟགས་པ། རྣམ་པར་བསྐྱེད་པ། ཡོངས་སུ་བསྒྲུབས་པ་སྟེ། མི་རྟག་ཅིང་མི་བརྟན་ལ། ཐེར་ཟུག་མ་ཡིན་འགྱུར་བའི་ཆོས་ཅན་ཏེ། དངོས་པོ་མེད་པས་དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་། མི་དང་།
en: However, Subhūti, because this realm of desire is imagined, generated, and fabricated, its attributes being impermanent, unstable, ephemeral, and changeable, and because it is a nonentity, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་གཟུགས་ཀྱི་ཁམས་དེ་བཞིན། མ་ནོར་བ་དེ་བཞིན་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཏེ། ཕྱིན་ཅི་ལོག་མ་ཡིན་ལ་བདེན་པ་ཡང་དག་པ་སྟེ། ཇི་ལྟ་བ་བཞིན་དུ་རྟག་ཅིང་བརྟན་ལ། ཐེར་ཟུག་མི་འགྱུར་བའི་ཆོས་ཅན་གྱི་དངོས་པོ་ཞིག་ཡིན་ན་ནི། ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་།
en: Subhūti, if the realm of form were an entity, endowed with the attributes of being unmistaken, one and only, incontrovertible, genuine, true, qualitative, permanent, stable, eternal, and unchanging, then indeed this Great Vehicle would not overpower and attain emancipation from the world with its gods, humans, and asuras.

source: ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་གཟུགས་ཀྱི་ཁམས་དེ་རྣམ་པར་བརྟགས་པ། རྣམ་པར་བསྐྱེད་པ། ཡོངས་སུ་བསྒྲུབས་པ་སྟེ། མི་རྟག་ཅིང་མི་བརྟན་ལ། ཐེར་ཟུག་མ་ཡིན་འགྱུར་བའི་ཆོས་ཅན་ཏེ། དངོས་པོ་མེད་པས་དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས།
en: However, Subhūti, because the realm of form is imagined, generated, and fabricated, its attributes being impermanent, unstable, ephemeral, and changeable, and because it is a nonentity, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་གཟུགས་མེད་པའི་ཁམས་དེ་བཞིན་མ་ནོར་བ་དེ་བཞིན། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཏེ། ཕྱིན་ཅི་ལོག་མ་ཡིན་ལ། བདེན་པ་ཡང་དག་པ་སྟེ། ཇི་ལྟ་བ་བཞིན་དུ་རྟག་ཅིང་བརྟན་ལ། ཐེར་ཟུག་མི་འགྱུར་བའི་ཆོས་ཅན་གྱི་དངོས་པོ་ཞིག་ཡིན་ན་ནི།
en: Subhūti, if the realm of formlessness were an entity, endowed with the attributes of being unmistaken, one and only, incontrovertible, genuine, true, qualitative, permanent, stable, eternal, and unchanging, then indeed this Great Vehicle would not overpower and attain emancipation from the world with its gods, humans, and asuras.

source: ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་གཟུགས་མེད་པའི་ཁམས་དེ་རྣམ་པར་བརྟགས་པ་རྣམ་པར་བསྐྱེད་པ། ཡོངས་སུ་བསྒྲུབས་པ་སྟེ།
en: However, Subhūti, because the realm of formlessness is imagined, generated, and fabricated, its attributes being impermanent, unstable, ephemeral, and changeable, and because it is a nonentity, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras. “

source: མི་རྟག་ཅིང་མི་བརྟན་ལ། ཐེར་ཟུག་མ་ཡིན་འགྱུར་བའི་ཆོས་ཅན་ཏེ། དངོས་པོ་མེད་པས་དེའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདིས། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཏེ་འབྱུང་བ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་གཟུགས་དེ་བཞིན། མ་ནོར་བ་དེ་བཞིན། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཏེ། ཕྱིན་ཅི་ལོག་མ་ཡིན་ལ། བདེན་པ་ཡང་དག་པ་སྟེ། ཇི་ལྟ་བ་བཞིན་དུ་རྟག་ཅིང་བརྟན་ལ། ཐེར་ཟུག་མི་འགྱུར་བའི་ཆོས་ཅན་གྱི་དངོས་པོ་ཞིག་ཡིན་ན་ནི།
en: Subhūti, if physical forms were entities, endowed with the attributes of being unmistaken, one and only, incontrovertible, genuine, true, qualitative, entirely permanent, stable, eternal, and unchanging, then indeed this Great Vehicle would not overpower and attain emancipation from the world, with its gods, humans, and asuras.

source: ཐེག་པ་ཆེན་པོ་འདིས་ཀྱང་། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འབྱུང་བར་མི་འགྱུར་ཏེ། རབ་འབྱོར་གཟུགས་དེ་རྣམ་པར་བརྟགས་པ། རྣམ་པར་བསྐྱེད་པ། ཡོངས་སུ་བསྒྲུབས་པ་སྟེ།
en: However, Subhūti, because physical forms are imagined, generated, and fabricated, with the attributes of being impermanent, unstable, ephemeral, and changeable, and because they are nonentities, this Great Vehicle does overpower and attain emancipation from the world, with its gods, humans, and asuras.
